Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/european_government/eu_institutions/court_of_auditors.html.txt.tmx
Source language: en
Languages: ga

source: The Court of Auditors has its headquarters in Luxembourg and is composed of 28 members, one from each member state
ga: Is sa Lucsamburg atá ceanncheathrú Chúirt na nIniúchóirí agus tá 28 ball ann, duine ó gach ballstát

source: Each member state suggests a candidate who is appointed by the Council of the European Union in consultation with the European Parliament for a renewable term of 6 years
ga: Molann gach ballstát iarrthóir a cheapann an Chomhairle Aontas na hEorpa ansin i gcomhairle le Parlaimint na hEorpa ar feadh tréimhse inathnuaite de 6 bliana

source: Members of the Court of Auditors are independent and have experience in the field of audit of public finances
ga: Tá baill Chúirt na nIniúchóirí neamhspléach agus bíonn taithí acu iniúchadh a dhéanamh ar airgead poiblí

source: The court members elect their president for a term of 3 years
ga: Toghann Baill na Cúirte Uachtarán ar feadh tréimhse 3 bliana

source: The main task of the Court of Auditors is to audit the accounts and oversee the implementation of the budgets of the institutions of the European Union
ga: Tá sé mar phríomhdhualgas ag Cúirt na nIniúchóirí iniúchadh a dhéanamh ar chuntais agus breathnú i ndiaidh cur i bhfeidhm na mbuiséad in institiúidí Aontas na hEorpa

source: It aims to improve financial management of EU money and to report to EU citizens on how EU money is used
ga: Tá sé mar aidhm aici bainistíocht airgeadais a fheabhsú maidir le airgead an Aontais agus tuairisc a chur ar fáil do shaoránaigh an AE maidir leis an mbealach ina gcaitear airgead an AE

source: It draws up an annual report at the end of each financial year
ga: Cuireann sí tuairisc bhliantúil le chéile ag deireadh na bliana airgeadais

source: This is forwarded to the other institutions and must be published in the Official Journal of the Community so that any person can study the budget and spending of any particular EU institution
ga: Cuirtear an tuairisc seo ar fáil do na hinstitiúidí eile agus ní mór í a fhoilsiú in Iris Oifigiúil an Chomhphobail ionas gur féidir le duine ar bith scrúdú a dhéanamh ar an mbuiséad agus ar chaiteachas aon institiúide de chuid an AE
